package Kodesource;
//Напишите программу на Java для преобразования заданной строки в строчные.
public class T59 {
    public static void main(String[] args) {
        String input = "Быстрая Коричневая  Лиса прыгает Лерез   ленивую собаку";

        String lowerStr = input.toLowerCase();
        System.out.println(lowerStr);
    }
}
